{
  "basics": {
    "link":[{"href":"resume/rus","label":"RU"}],
    "picture": "cv.jpg",
    "name": "Stepanenko Anatolii",
    "label": "Jr. Java Developer",
    "email": "anatoliy.s.stepanenko@yandex.ru",
    "summary": "Hi! My name is Stepanenko Anatolii. I’m a problem-driven, highly motivated, fast learning software developer with more, than 1 year of experience in Software Design and Development. I’m looking for an opportunity of working in a dynamic, challenging environment, where I can utilize my skills for development of career and for the growth of the organization.",

    "highlights": [
      "Hands on experience Spring Frameworks (Core, JDBC, ORM, Web, CDI, AOP), Spring MVC.",
      "Hands on experience in Core Java, Java 8, JQuery, Spring Boot and ORM Hibernate.",
      "Hands on experience in TDD using JUnit, Mockito and MockMVC.",
      "Experience in working with databases such as Oracle RDBMS, CouchDB, PostgreSQL.",
      "Knowledge and understanding of OOP principles.",
      "Good Team player.",
      "Adaptive for learning of new technologies."
    ],
    "location": {
      "countryCode": "Russia"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "anatoliystepanenko",
        "url": "https://ru.linkedin.com/in/anatoliystepanenko"
      },
      {
        "network": "GitHub",
        "username": "Blazar3C273",
        "url": "https://github.com/Blazar3C273"
      }
    ],
    "pdf":{"href":"Stepanenko_A_EN_CV.pdf","label":"Download pdf"}
  },
  "work": [
    {
      "company": "M-Exchange AG, Munich Area, Germany",
      "position": "Jr. Java Developer (remote)",
      "website": "http://www.m-exchange.de/",
      "startDate": "2016-01-12",
      "endDate": "2016-07-12",
      "summary": "This is my first position, related to Java Enterprise. I was impressed by the size and complexity of the system, which I had the opportunity to maintain and develop. Accepting the challenge, I plunged into work. For a short period I have learnt and then worked with the Java world technologies such as Spring Framework and Spring MVC web framework. In the process of implementation of the new features, I had to face with the system's front-end. It was implemented using JQuery library and some other components, which had been written before me. Architectural system was a classic three-galleries monolith. So of course I had to study the database. The project used the Oracle 11 DBMS. Quite often, I had to write queries to the database even though the fact, that the project was used Hibernate JPA provider. Also, data source selection has been designed quite unusual, but about it - on an interview ;-) (Note: All the above does not violate the NDA.) I was interested in this position, not only from a technological point of view. Workflow required from me some communication skills, also the first time in my career, such as a multi-pronged communication (written communication, for example, in Jira, verbal at the weekly Skype meetings) in non-native English language for me.",
      "highlights": [
        "Spring Framework & Spring MVC",
        "Hibernate & HQL",
        "JQuery",
        "Oracle RDBMS"
      ]
    },
    {
      "company": "Self employed. Direct contract with customer.",
      "position": "Java and Android Developer",
      "website": "http://tgliamz.ru/",
      "startDate": "2014-11-01",
      "endDate": "2015-03-01",
      "summary": "Main function of this system is to provide to customer’s visitors additional contextual information about exhibit such as additional text, archive images, photos and other multimedia materials through branded Android mobile app. Project results: successful implementation, a satisfied customer and thousands of satisfied users. There is a letter of recommendation. My responsibilities:",
      "highlights": [
        "as a project manager: Business meeting with the customer at all project stages, project planning, task management, project reporting to the customer, writing technical documentation and instructions.",
        "as a developer: Design of the system architecture, the choice of database (selected db is CouchDB - a document-oriented noSQL), design of the document’s structure, writing a tests (JUnit), design and implementation of mobile (Android) application, of content management desktop application (Java, Swing) and writing installation scripts."
      ]
    }
  ],
  "education": [
    {
      "institution": "Engineering and Technology Academy of Southern Federal University",
      "area": "Computer-aided design (CAD)",
      "studyType": "Engineer at specialty (between BSc and MS. German 'Diplom' degree)",
      "startDate": "2010-09-01",
      "endDate": "2015-09-01"
    }
  ],
  "skills": [
    {
      "name": "Java ",
      "keywords": [
        "Java Core",
        "Java 8",
        "Maven",
        "Tomcat",
        "Swing",
        "JUnit",
        "Mockito",
        "MockMVC",
        "Slf4J",
     	"LogBack",
     	"Lombock"

          ]
        },
    {
      "name": "Spring",
      "keywords": [
        "Spring Core",
        "Spring Boot",
        "Spring MVC",
        "ORM Hibernate",
        "JDBC Template",
        "AOP",
        "JTA",
        "Validation"
      ]
    },
    {
      "name": "SQL/noSQL",
      "keywords": [
        "Oracle 11g",
        "PostgreSQL",
        "CouchDB"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "IntelliJ IDEA",
        "Git",
        "Docker"
        ,"Jira"
      ]
    },
    {
      "name":"Web",
      "keywords": [
        "HTML"
        ,"CSS"
        ,"JQuery"
        ,"Vaadin"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "intermediate"
    },
    {
      "language": "Russian",
      "fluency": "native speaker"
    }
  ],
  "references": [
    {
      "name": " Senior Systems Analyst at Porto Seguro(via LinkedIn)",
      "reference": "Anatolii is a good professional. He seems to be always available to help whatever is the subject.  He knows how to work and collaborate with the team.  He is also up to date with the new technologies.  One time I was developing a report solution and Anatolii helped me presenting some important suggestions regarding data security."
    }
  ]
}